{  
   "projects":{  
      "Apteligent":{  
         "name":"Apteligent App",
         "github":"https://github.com/sjscott84/apteligent-mobile-app",
         "description":"This open source app was built for Apteligent to demonstrate how their public api could be utilized.  It was built using React Native, which lets you build a real mobile app that's indistinguishable from an app built using Objective-C or Java. React Native uses the same fundamental UI building blocks as regular iOS and Android apps. You just put those building blocks together using JavaScript and React.  One of the major challenges I encountered in building this application was building the graphs, as I was unable to find a suitable graphing library that integrated with React Native, so I had to build my own.  Luckily, the rest of the development process went smoothly. Unfortunately, this app is yet to be released."
      },
       "Trip":{  
         "name":"Tripommendation App",
         "github":"https://github.com/sjscott84/Map-Notes-App",
         "description":"This app is a personal project that has recently been published to itunes, the basic concept is that it is an app where you can save all travel recommendations, in groups and with notes, in one place while still utilizing the power of google maps.  It is a hybrid app that is built using the Ionic v1 framework for the app and Google Firebase for the user authentication and database.  One of the major challenges has been integrating Ionic and Google Maps in a UI that feels modern, this is something I am still figuring out.  It can be found on the itunes store under Tripommendation"
      },
      "Sorting":{
        "name": "Sorting Algorithms",
        "github": "https://github.com/sjscott84/Sorting-Algorithms",
        "description": "This is a simple program, written in Java, that I built to learn some of the fundamental sorting algorithms and to practise writing code in java." 
      },
      "Weather":{
        "name": "Weather App",
        "github": "https://github.com/sjscott84/WeatherDemo",
        "description": "This very simple app was built for a Brown Bag showcasing React Native that I presented.  It was built to show how easy and how fast puttting together a native application is using React Native, and how smooth the reload and debugging tools are."
      },
      "Algorithms":{
        "name": "Sorting Algorithms",
        "github": "https://github.com/sjscott84/sorting-algorithms-with-tests",
        "description": "This is a simple program I wrote in Java to practice some of the sorting algorithms I was learning in Algorithms Unlocked.  I also used this project as an opportunity to get more practice writing tests and to play around with the Java Scene Builder."
        },
      "textEditor": {
        "name": "Data Structures and Performance Course Project / Text Editor",
        "github":"https://github.com/sjscott84/Java-Data-Structures",
        "description": "This is a description"
      },
      "routeFinder": {
        "name": "Advanced Data Structures Course Project / Route Finder",
        "github": "https://github.com/sjscott84/Java-Advanced-Data-Structures",
        "description": "This is a description"
      }
   },
   "about": "Hi, thanks for visiting my page! My name is Sarah and I am a former Project Manager and a current wannabe Programmer.  I discovered programming thanks to Visual Basics for Applications, and haven’t looked back since.  I have spent the last 18 months retraining myself by doing online courses, self study and working on applications both for myself and for others.  I now know JavaScript (and some of its many libraries and frameworks), Java and Python.  I find myself becoming more and more fascinated with Computer Science the more I learn and regularly study algorithms, mathematics, data structures and design patterns.  I have even started getting interested in Machine Learning. Not bad for an arts major huh?"
}